import streamlit as st

from main import user_input_feature  

col1, col2, col3 = st.columns([1,2,3])

col1.page_link("main.py", label="หน้าหลัก", icon="🏠")
col2.page_link("pages/about.py", label="ข้อมูลเกี่ยวกับโรคหัวใจ", icon="1️⃣")
col3.page_link("pages/introducetion.py", label="ติดต่อผู้เชี่ยวชาญ", icon="2️⃣", disabled=False)

st.title("ข้อมูลที่เกี่ยวข้องกับโรคหัวใจ")
# st.sidebar.title("หน้าต่างนำทาง")
# if st.sidebar.button("ทำนายโรคหัวใจ"):
#         st.experimental_set_query_params(page="about-heart")
#         st.experimental_rerun()
# if st.sidebar.button("ติดต่อศูนย์โรคหัวใจ"):
#         st.experimental_set_query_params(page="about-heart")
#         st.experimental_rerun()


# Your content goes here
st.sidebar.image("images/heart-sidebar.png", width=100)
# Table of Contents
st.sidebar.title("ตารางเนื้อหา")
st.sidebar.markdown("[โรคหัวใจ (Heart Disease)](#2e7ff63f)")
st.sidebar.markdown("[สาเหตุของการเกิดโรคหัวใจ](#a4243d50)")
st.sidebar.markdown("[ปัจจัยเสี่ยงของการเกิดโรคหัวใจ](#1964d33a)")
st.sidebar.markdown("[การป้องกันโรคหัวใจ](#9e69c31a)")
st.sidebar.markdown("[การวินิจฉัยโรคหัวใจ](#c30884f8)")
st.sidebar.markdown("[การรักษาโรคหัวใจ](#f7f0d164)")



st.subheader("โรคหัวใจ (Heart Disease) ")
st.markdown("""
   โรคหัวใจ หรือ Heart Disease หมายถึง โรคต่าง ๆ ที่ส่งผลกระทบต่อการทำงานของหัวใจ โดยความผิดปกติที่เกิดขึ้นในส่วนของหัวใจที่ต่างกัน ทำให้โรคหัวใจมีอาการต่างกันไปในแต่ละชนิดดังนี้
   - **โรคหลอดเลือดหัวใจ** เจ็บหรือแน่นหน้าอก ร้าวไปตามกราม แขน ลำคอ เหนื่อย อ่อนเพลีย หรือหมดสติได้
- **โรคหัวใจเต้นผิดจังหวะ** หัวใจอาจเต้นเร็วหรือช้ากว่าผิดปกติ ใจสั่น เหนื่อยง่าย แน่นหน้าอก เวียนศีรษะ หรือคล้ายจะเป็นลม
- **โรคกล้ามเนื้อหัวใจ** เหนื่อยง่าย หายใจไม่อิ่ม มักมีอาการมากขึ้นเมื่อต้องออกแรงหนัก ๆ บวมตามแขน ขา นอนราบไม่ได้ และตื่นขึ้นมาไอในเวลากลางคืน
- **โรคหัวใจพิการแต่กำเนิด** เป็นโรคที่เกิดขึ้นตั้งแต่เมื่อทารกอยู่ในครรภ์มารดาทารกมีอาการเหนื่อยขณะให้นม เลี้ยงไม่โต
- **โรคลิ้นหัวใจ** หากมีความผิดปกติของลิ้นหัวใจมาก จะมีอาการเหนื่อยง่าย และเกิดภาวะหัวใจวายหรือน้ำท่วมปอดได้        
- **โรคติดเชื้อบริเวณหัวใจ** เป็นไข้เรื้อรัง อ่อนเพลีย เหนื่อยล้า หัวใจเต้นผิดปกติ หายใจหอบเหนื่อย ไอเรื้อรังแห้ง ๆ ขาหรือช่องท้องบวม รวมถึงมีผื่นหรือจุดขึ้นตามผิวหนัง

        """)
st.subheader(" สาเหตุของการเกิดโรคหัวใจ")
st.markdown("""

สาเหตุของโรคหัวใจขึ้นอยู่กับชนิดของโรคหัวใจนั้น ๆ สำหรับโรคหลอดเลือดหัวใจจากภาวะการเสื่อมของหลอดเลือด มีสาเหตุไม่ชัดเจนแต่พบว่าสัมพันธ์กับปัจจัยเสี่ยงต่าง ๆ โดยปัจจัยเสี่ยงแบ่งออกเป็นสองประเภท คือ

- ปัจจัยเสี่ยงที่ควบคุมได้และสามารถปรับเปลี่ยนได้
- ปัจจัยเสี่ยงที่ควบคุมไม่ได้และไม่สามารถเปลี่ยนแปลง เช่น อายุ เพศ หรือประวัติสุขภาพของคนในครอบครัว แต่สามารถชะลอโรคด้วยการควบคุมปัจจัยเสี่ยงที่บริหารเองได้เพื่อป้องกันโรคหัวใจที่จะเกิดขึ้นในอนาคตได้
            
            """)
st.subheader(" ปัจจัยเสี่ยงของการเกิดโรคหัวใจ")
st.markdown("""
- **อายุ** - การมีอายุมากขึ้นจะเพิ่มความเสี่ยงของหลอดเลือดแดงที่เสียหาย ตีบและกล้ามเนื้อหัวใจอ่อนแรง
- **เพศ** - ผู้ชายทั่วไปมีความเสี่ยงต่อการเป็นโรคหัวใจมากกว่า แต่สำหรับผู้หญิงจะมีความเสี่ยงเพิ่มขึ้นหลังหมดประจำเดือน
- **ปัจจัยทางพันธุกรรม** - ครอบครัวที่มีสมาชิกในครอบครัวเป็นโรคหัวใจจะเพิ่มความเสี่ยงการเป็นโรคหลอดเลือดหัวใจ โดยเฉพาะอย่างยิ่งหากพ่อแม่เป็นโรคนี้ตั้งแต่อายุยังน้อย (ก่อนอายุ 55 ปีสำหรับผู้ชาย และ 65 สำหรับผู้หญิง)
- **สูบบุหรี่** - สารนิโคตินทำให้หลอดเลือดของคุณมีสภาวะหดตัว และก๊าซคาร์บอนมอนอกไซด์สามารถทำลายเยื่อบุชั้นในได้ จึงทำให้เสี่ยงต่อการเกิดโรคหลอดเลือดหัวใจได้ง่ายขึ้น โดยอาการหัวใจวายพบได้บ่อยในผู้สูบบุหรี่มากกว่าผู้ที่ไม่สูบบุหรี่
- **การกินอาหารแบบผิด ๆ** - อาหารที่มีไขมันอิ่มตัว เกลือ น้ำตาล และคอเลสเตอรอลสูง สามารถทำให้เกิดโรคหัวใจได้
- **ความดันโลหิตสูง** ความดันโลหิตสูงที่ไม่สามารถควบคุมได้ อาจส่งผลให้หลอดเลือดแดงแข็งตัวและหนาขึ้นทำให้หลอดเลือดตีบแคบลง
- **ระดับคอเลสเตอรอลในเลือดสูง** - ระดับคอเลสเตอรอลในเลือดที่สูงโดยเฉพาะชนิดความหนาแน่นต่ำ (LDL-cholesterol) สามารถเพิ่มความเสี่ยงต่อการเกิดโรคหลอดเลือดหัวใจ
- **โรคเบาหวาน** - โรคเบาหวานเพิ่มความเสี่ยงต่อการเป็นโรคหัวใจ
- **โรคอ้วน** - น้ำหนักส่วนเกินมักทำให้เกิดปัจจัยเสี่ยงโรคหัวใจอื่น ๆ เช่น เบาหวาน ไขมันในเลือดสูง ความดันโลหิตสูงเพิ่มมากขึ้น
- **การขาดการออกกำลังกาย** - มีส่วนเกี่ยวข้องกับปัจจัยเสี่ยงต่าง ๆ เช่น เบาหวาน ความดันโลหิตสูง และเพิ่มความเสี่ยงโรคหัวใจ
- **ความเครียด** - ปัจจัยเสี่ยงทางด้านจิตใจ อาจส่งผลไปกระตุ้นระบบประสาทอัตโนมัติที่กระตุ้นหัวใจและหลอดเลือด เพิ่มความเสี่ยงให้เกิดอาการของโรคหัวใจมากขึ้น


            """)
st.subheader(" การป้องกันโรคหัวใจ")
st.markdown("""
            การป้องกันโรคหัวใจ
ขึ้นอยู่กับชนิดของโรคหัวใจ สำหรับโรคหลอดเลือดหัวใจแม้ไม่มีสาเหตุเฉพาะเจาะจงชัดเจน แต่ก็มีปัจจัยสิ่งหลายอย่างที่หากเราควบคุมได้ดีจะช่วยลดโอกาสโรคหลอดเลือดหัวใจลงได้มาก เช่น

- หลีกเลี่ยงการสูบบุหรี่
- ควบคุมความดันโลหิตไม่ให้สูงเกินมาตรฐาน ควบคุมคอเลสเตอรอล และเบาหวาน
- ออกกำลังกายสม่ำเสมอ อย่างน้อย 30 นาทีต่อวัน
- รับประทานอาหารที่มีเกลือและไขมันอิ่มตัวต่ำ
- ควบคุมน้ำหนักไม่ให้เกินมาตรฐาน
- ลดความเครียด
- ฝึกสุขอนามัยที่ดี
            """)
st.subheader("การวินิจฉัยโรคหัวใจ")
st.markdown("""
            การวินิจฉัยโรคหัวใจ
แพทย์จะทำการตรวจร่างกายและสอบถามประวัติของคนไข้และครอบครัว นอกจากการสอบถามประวัติโดยละเอียด การตรวจร่างกายการตรวจเลือด และเอกซเรย์ทรวงอกแล้ว การทดสอบพิเศษทางหัวใจต่างๆจะช่วยในการวินิจฉัย เช่น

- **การตรวจคลื่นไฟฟ้าหัวใจ (ECG หรือ EKG)**
คลื่นไฟฟ้าหัวใจเป็นการตรวจทดสอบที่รวดเร็วและไม่เจ็บปวด
- **เครื่องบันทึกคลื่นไฟฟ้าหัวใจ 24 ชั่วโมง หรือ Ambulatory ECG Monitoring หรือ Holter ECG**
เป็นอุปกรณ์ ECG แบบพกพาที่สามารถใส่เพื่อบันทึกจังหวะการเต้นของหัวใจอย่างต่อเนื่องโดยปกติจะใช้เวลา 24 ถึง 72 ชั่วโมง การตรวจสอบ โดยใช้เพื่อตรวจจับปัญหาจังหวะการเต้นของหัวใจที่ไม่พบในระหว่างการตรวจคลื่นไฟฟ้าหัวใจปกติ
- **การตรวจหัวใจด้วยคลื่นเสียงความถี่สูง หรือ Echocardiogram**
เป็นการทดสอบแบบใช้คลื่นเสียงสะท้อนหัวใจ เพื่อสร้างภาพและตรวจวัดโครงสร้างหัวใจโดยละเอียด ขนาดของหัวใจการทำงานของกล้ามเนื้อหัวใจลิ้นหัวใจผนังกั้นและผนังหุ้มหัวใจ
- **Stress Test**
เป็นการทดสอบการเพิ่มอัตราการเต้นและบีบตัวของหัวใจด้วยการออกกำลังกาย หรือยา และวัดการตอบสนองทั้งชีพจรความดันโลหิตความผิดปกติของคลื่นไฟฟ้าหัวใจและบางรายวัดความผิดปกติของกล้ามเนื้อหัวใจโดยการตรวจ Echocardiogram (Stress Echocardiogram) ช่วยในการวินิจฉัยโรคหลอดเลือดหัวใจภาวะหัวใจเต้นผิดจังหวะบางครั้งประเมินหลอดเลือดและสมรรถภาพการบีบตัวของกล้ามเนื้อที่ผนังหัวใจ
- **การสวนหัวใจ**
เป็นการใส่ท่อสั้น ๆ เข้าไปในหลอดเลือดดำหรือหลอดเลือดแดงบริเวณขาหรือแขน เพื่อตรวจวัดภายในห้องหัวใจโดยตรงหรือการวินิจฉัยโรคหลอดเลือดหัวใจ โรคลิ้นหัวใจ หรือผนังกั้นหัวใจผิดปกติ โรคหัวใจพิการแต่กำเนิด
- **การสแกนเอกซเรย์คอมพิวเตอร์หัวใจ หรือ CT SCAN**
เป็นการทดสอบแบบใช้เอ็กซเรย์เพื่อสร้างภาพโครงสร้างโดยละเอียด เพื่อวัดคะแนนหินปูนของหลอดเลือดหัวใจ (Coronary Calcium Score) และหากฉีดสารทึบรังสีด้วย จะได้ภาพของหลอดเลือดหัวใจหรือหลอดเลือดแดงใหญ่ หลอดเลือดปอด เพื่อวินิจฉัยโรคหลอดเลือดต่าง ๆ ความผิดปกติของกล้ามเนื้อหัวใจ ผนังหัวใจ
            """)
st.subheader("การรักษาโรคหัวใจ")
st.markdown("""
          
ชนิดการรักษาจะขึ้นอยู่กับประเภทของโรคหัวใจ โดยทั่วไปมักประกอบด้วย:

**การปรับเปลี่ยนวิถีชีวิต**
ลดความเสี่ยงในการเป็นโรคหัวใจได้ด้วยการรับประทานอาหารสุขภาพ เช่น ลดการรับประทานอาหารที่มีน้ำตาลสูง เกลือโซเดียมสูง ไขมันอิ่มตัวสูง คอเลสเตอรอลสูง รับประทานอาหารที่มีไขมันไม่อิ่มตัวโอเมก้า 3 แทน เพิ่มการรับประทานผักและผลไม้หลากหลายชนิด ออกกำลังกายสม่ำเสมออย่างน้อย 150-300 นาทีต่อสัปดาห์ งดสูบบุหรี่และเครื่องดื่มแอลกอฮอล์
ยา
หากการปรับเปลี่ยงวิถีชีวิตเพียงอย่างเดียวยังไม่เพียงพอ แพทย์อาจจ่ายยาเพื่อควบคุมโรคหัวใจหรือปัจจัยเสี่ยง ซึ่งจะขึ้นอยู่กับประเภทของโรคหัวใจ


การรักษาอื่น ๆ นอกจากการรับประทานยา:

**การรักษาด้วยหัตถการหลอดเลือดหรือการผ่าตัด**
- การขยายหลอดเลือดหัวใจด้วยบอลลูนและขดลวด
- การขยายลิ้นหัวใจที่ตีบด้วยบอลลูน
- การใส่ลิ้นหัวใจเทียมแทนลิ้นหัวใจที่ตีบจากการเสื่อมสภาพ โดยการสอดใส่ผ่านทางหลอดเลือด
- การปิดกั้นผนังกั้นหัวใจที่รั่วด้วยอุปกรณ์พิเศษผ่านทางหลอดเลือด
- การจี้หัวใจเต้นผิดจังหวะบางชนิดด้วยคลื่นไฟฟ้าความถี่สูงโดยการใส่สายผ่านทางหลอดเลือด
- การผ่าตัดฝังเครื่องกระตุ้นไฟฟ้าหัวใจชนิดถาวร
- การผ่าตัดฝังเครื่องกระตุ้นไฟฟ้าหัวใจอัตโนมัติ
- การผ่าตัดหลอดเลือดหัวใจโดยใช้หลอดเลือดของผู้ป่วยเอง (Coronary artery bypass graft surgery)
- การผ่าตัดเปลี่ยนลิ้นหัวใจเทียม


**การรักษาด้วยเวชศาสตร์ฟื้นฟูและกายภาพบำบัด**


ช่วยฟื้นฟูร่างกายให้สามารถกลับมาแข็งแรงใช้ชีวิตประจำวันได้ และหากเป็นไปได้ให้สามารถออกกำลังกายได้มากขึ้น เพื่อช่วยในการควบคุมปัจจัยเสี่ยงลดอาการโรคหัวใจได้ดีขึ้น โดยในช่วงแรกอาจอยู่ภายใต้การดูแลใกล้ชิดของแพทย์และนักกายภาพบำบัด และค่อย ๆ ปรับเพิ่มโปรแกรมที่สามารถทำได้เองมากขึ้นจนสามารถปฏิบัติเองได้ที่บ้านทั้งหมด
           
            """)
st.markdown("""
            **References:**
            
            - Author: MedPark Hospital ([MedPark Hospital](https://www.medparkhospital.com/disease-and-treatment/heart-disease))
            - Author: SIKARIN ([SIKARIN](https://www.sikarin.com/health/%E0%B9%82%E0%B8%A3%E0%B8%84%E0%B8%AB%E0%B8%B1%E0%B8%A7%E0%B9%83%E0%B8%88%E0%B8%A1%E0%B8%B5%E0%B8%81%E0%B8%B5%E0%B9%88%E0%B8%8A%E0%B8%99%E0%B8%B4%E0%B8%94-%E0%B8%AD%E0%B8%B2%E0%B8%81%E0%B8%B2#:~:text=%E0%B9%82%E0%B8%A3%E0%B8%84%E0%B8%AB%E0%B8%B1%E0%B8%A7%E0%B9%83%E0%B8%88%20%E0%B8%AB%E0%B8%A3%E0%B8%B7%E0%B8%AD%20Heart%20Disease,%E0%B8%AD%E0%B9%88%E0%B8%AD%E0%B8%99%E0%B9%80%E0%B8%9E%E0%B8%A5%E0%B8%B5%E0%B8%A2%20%E0%B8%AB%E0%B8%A3%E0%B8%B7%E0%B8%AD%E0%B8%AB%E0%B8%A1%E0%B8%94%E0%B8%AA%E0%B8%95%E0%B8%B4%E0%B9%84%E0%B8%94%E0%B9%89))

""")
